# Реализуйте алгоритм нахождения(генерации) рандомного
# (случайного) числа.(Не используя библиотеки связанные с рандомом)


import datetime         # импортируем модуль времени

print(datetime.datetime.now().microsecond) # выводим милисекунды как случайное число